<?php 
header("Content-Type: text/html;charset=utf-8"); //PHP页面转UTF-8编码
// 注释
/*变量声明------------------------------------------------------------------------------
	变量以美元符 $ 开头，然后是变量名;
	变量名由字母或下划线开头，由字母，下划线，数字组成;
	变量名区分大小写;
	php 是弱类型的语言，不需要事先声明变量的数据类型;
	php可以不用显示的声明变量就直接使用，不过好的编码习惯：所有的变量在使用前应该进行声明;
----------------------------------------------------------------------------------------*/
/*1.值赋值----------------------------------------------
	值赋值：就是将赋值表达式的值复制到变量
-------------------------------------------------------*/
$a = 123;
$str = "{$a}中文内容";
// $str = '{$a}中文内容';
// echo $str;

/*2.引用赋值----------------------------------------------
	引用赋值：php4引入了引用赋值功能，创建的变量与另一个变量引用的内容相同
-------------------------------------------------------*/
$a = 5;
$b = &$a;//$b内存地址和$a相等了
$b = 10;
// echo "a:".$a;

//3.变量的变量--------------------------------------------
$a = "b";
$$a = "10";//$$a==$b
// echo "b:".$b;

/*4.PHP的超全局变量---------------------------------------
	$_SERVER 服务器变量
	该全局变量包含着服务器和客户端配置及当前请求环境的有关信息
	$_SERVER['SERVER_NAME']; : 当前运行脚本所在的服务器的主机名
	$_SERVER['REMOTE_ADDR']	: 客户端IP地址
	$_SERVER['REQUEST_URI']	: URL的路径部份
	$_SERVER['HTTP_USER_AGENT']  :  操作系统和浏览器的有关信息
----------------------------------------------------------*/ 
var_dump($_SERVER);
echo "主机名".$_SERVER["SERVER_NAME"]."<BR>";
echo "ip地址".$_SERVER["REMOTE_ADDR"]."<BR>";
echo "URL的路径部份".$_SERVER["REQUEST_URI"]."<BR>";
echo "操作系统和浏览器的有关信息".$_SERVER["HTTP_USER_AGENT"]."<BR>";




?>