<?php 
header("Content-Type: text/html;charset=utf-8"); //PHP页面转UTF-8编码
/*常量--------------------------------------------------
	常量是指在程序执行中无法修改的值。如 PI (3.1415926);
	在脚本执行期间该值不能改变;
	常量对大小写敏感，通常常量名总是大写;
	常量是全局的，可以在脚本的任何地方引用;
	常量分为内置常量和自定义常量;
	常量使用define()函数定义;
------------------------------------------------------*/
//1.常量的定义---------------------------------------------------
define("AA","123");
// echo AA;
/*2.内置常量-----------------------------------------------------
	PHP_OS          // PHP所在的操作系统的名字 
	PHP_VERSION      //当前 PHP 的版本 
------------------------------------------------------------------*/ 
// echo "PHP所在的操作系统的名字".PHP_OS;
// echo "当前 PHP 的版本".PHP_VERSION;

/*3.魔术常量-----------------------------------------------------
	__LINE__	文件中的当前行号;
	__FILE__	文件的完整路径和文件名;
	__FUNCTION__	函数名称;
	__CLASS__	类的名称;
	__METHOD__	类的方法名;
------------------------------------------------------------------*/ 
echo __LINE__;
echo __LINE__;
echo __FILE__;
function show()
{
	echo __FUNCTION__;
};
show();



 ?>


