<?php 
/*一、标量数据类型------------------------------------------------------
	1.字符串 (string)
		字符串有三种定义方式：单引号，双引号，定界符(heredoc);
		单引号字符串中出现的变量不会被变量的值替代;
		双引号字符串中最重要的一点是其中的变量会被变量值替代;
 		如果遇到美元符号($),解析器会尽可能多地取得后面的字符以组成一个合法的变量名,如果想明确的指定名字的结束，用花括号把变量名括起来。

		字符串定界的方法使用定界符语法 "<<<END"
		在PHP定界符中的任何特殊字符 都不需要转义 
		PHP定界符中的PHP变量会被正常的用其值来替换 
		使用定界符要注意：
		结束标识符所在的行不能包含任何其它字符，这意味着该标识符不能被缩进，在分号之前
		之后都不能有任何空格或制表符;

	2.整型(integer)

	3.浮点型(float, double)

	4.布尔型（bool）
--------------------------------------------------*/ 
$a = "AAAAA";
$str = <<<END
		速度多少
		速度
		sd 
		dsfs 
		{$a}
END;
// echo $str;


/*二、复合数据类型------------------------------------------------------
1.数组
	$week = array('星期一','星期二','星期三');
2.对象
	$db = new db;
------------------------------------------------------------------------*/ 
// $week = array('星期一',"a"=>'星期二','星期三');
// print_r($week);

/*三、特殊数据类型------------------------------------------------------
	1.资源
		$fh = fopen("test.txt","r");
	2.null
		null 无，表示没有值，null不表示空格，也不表示0;
		以下情况，则认为是null:
		
		没有设置为任何预定义的变量;
		明确的赋值为null;
		使用函数unset()清除;
------------------------------------------------------------------------*/ 
// $a = null;
// unset($a);
// echo $a;

/*四、类型自动转换---------------------------------------------------------------------
	因为php对于类型定义非常的松散，所以有时会根据引用变量的环境，将变量自动转换为
	最适合的类型;
	1.gettype() 返回变量的类型
	2.is_type() 查看变量是否属于某个类型,是返回 TRUE ,否返回 FALSE;
	3.var_dump()函数用来得到变量的类型和值的详细信息
------------------------------------------------------------------------------------*/ 
$num = 123;//integer整数
$float = 1.1211;//double浮点
$bol = true;//boolean true false
$str = "abc";//string字符串
$arr = array(10);//array数组

echo 1+true;
echo gettype($arr);
if (is_array($arr)) {
	echo "是";
}else{
	echo "不是";
}
?>