<?php 
/*1.算术运算符----------------------------------
	算术运算符，用于完成各种算术运算;
	+	加法运算			$a + $b
	-	减法运算			$a - $b
	* 	乘法运算			$a * $b
	/	除法运算			$a / $b
	%	取模运算（求余数)	$a % $b
-----------------------------------------------*/



/*2.赋值运算符----------------------------------
	赋值运算符，将一个数据值赋给一个变量;
	组合赋值运算符，在赋值之前会完成某个运算;
	$a = 5	赋值
	$a += 5		加法赋值  		$a = $a + 5
	$a -= 5		减法赋值		$a = $a – 5
	$a *= 5		乘法赋值		$a = $a * 5
	$a /= 5		除法赋值		$a = $a / 5	
-----------------------------------------------*/



/*3.字符串运算符--------------------------------------------------
	字符串运算符用于拼接字符串, 拼接表示将两个或多个对象组合起来;
	$a .= 5		拼接赋值		$a = $a.5
-----------------------------------------------------------------*/


/*4.递增(++)和递减(--)运算符---------------------------------------------
	递增和递减运算符将变量的当前值加1或减1，可以使代码更简洁;
	++$i		先加	$i的值加1，然后再返回$i的值;
	$i++		后加	先返回$i的值，然后再将$i的值加1;
	--$i		先减	$i的值减1，然后再返回$i的值;
	$i--		后减	先返回$i的值，然后再将$i的值减1;
-------------------------------------------------------------------------*/
$i=0;
// echo ++$i == $i++;

/*5.逻辑运算符------------------------------------------------------------
	利用逻辑运算符可以根据多个变量的值进行判断，这使得控制程序的流程成为可能，逻辑
操作符常用于控制结构中，如if条件和while及for循环;
	&&		AND		逻辑与		
	||		OR		逻辑或
	! 		NOT		逻辑非
---------------------------------------------------------------------------*/
$a = 4;
$b = 3;
$c = 6;
// if ($a>$b || $c<$b) {
// 	echo "对";
// }else{
// 	echo "错";
// }


/*6.比较运算符-------------------------------------------------------------
	比较运算符，返回一个布尔值 TRUE 或 FALSE;
	>	大于
	<	小于
	>=	大于或等于
	<=	小于或等于
	
	!=	不等于
	<>	不等于

	==	等于
	===	全等于  （两个比较的内容里，类型也要一样）
	!== 全不等
--------------------------------------------------------------------------*/
// echo 1==="1";
/*7.三元运算符-------------------------------------------
	语法：
	expression1 ? expression2 : expression3
---------------------------------------------------------*/
$a = 5;
$b = 6;
$c = $a>$b ? 1 : 2;
// if ($a>$b) {
// 	$c = 1;
// }else{
// 	$c = 2;	
// }
echo $c;

 ?>









