<?php
header("Content-Type: text/html;charset=utf-8"); //PHP页面转UTF-8编码
//变量分为:全局变量，局部变量，静态变量;

/*1.局部变量-----------------------------------------
	函数体内定义的变量为局部变量，只在函数体内可见;
	局部变量的作用域：从声明它的那条语句开始到函数结束;
-----------------------------------------------*/
// function show(){
// 	$a = 10;
// }
// show();
// echo $a;


/*2. 全局变量---------------------------------------
	函数体外定义的变量为全局变量，与局部变量相反，全局变量可以在程序的任何地方访问;
	如果在函数体中需要使用全局变量，使用 global 关键字访问;	
	全局变量的作用域：从声明它的那条语句开始到文件末尾;
-----------------------------------------------*/
// $a = 5;
// function show(){
// 	global $a;//声明使用全局$a
// 	$a = 10;
// }
// show();
// echo $a;
/*3. 静态变量---------------------------------------
	局部变量在函数退出时会被撤消，与局部变量不同，静态变量在函数退出时不会丢失值，并且再次调用函数时还能保留这个值;
	在变量名前面加上 static 关键字就可以声明一个静态变量;
-----------------------------------------------*/
function show(){
	static $a = 10;
	$a += 10;
	echo "$a"."<br>";
}
show();
show();
show();
show();








 ?>









